
var datasets = {};


var riversNames = [
    {
        key: "Дунай", 
        value: "danube", 
        lat: "20.00", 
        lon: "48.30", 
        scale: "2700", 
        color: "viridisScale"
    },
    {
        key: "Дністер", 
        value: "dnister", 
        lat: "25.53", 
        lon: "49.00", 
        scale: "4000", 
        color: "viridisScale"
    },
    {
        key: "Дніпро", 
        value: "dnipro", 
        lat: "30.53", 
        lon: "52.45", 
        scale: "3000", 
        color: "viridisScale"
    },
    {
        key: "Дон", 
        value: "don", 
        lat: "41.53", 
        lon: "51.55", 
        scale: "3000", 
        color: "infernoScale"
    },
    {
        key: "Південний Буг", 
        value: "southernbug", 
        lat: "30.53", 
        lon: "49.00", 
        scale: "4000", 
        color: "infernoScale"
    },
    {
        key: "Вісла", 
        value: "wisla", 
        lat: "25.53", 
        lon: "54.00", 
        scale: "4000", 
        color: "infernoScale"
    }
];


var indicatorNames = [
    {
        key: "Азот.загальний..мг.дм3",
        abr: "Азот.заг.",
        printName: "Азот загальний",
        description: "Входить до складу багатьох органічних сполук. У великій кількості сприяє росту мікроскопічних бактерій у воді. Може потрапити у воду з каналізаційних стоків або сільськогосподарських добрив"
    },
    {
        key: "Амоній.іони..мг.дм3",
        abr: "Амоній.іони",
        printName: "Іони амонію",
        description: "З’являються у воді, яку недавно забруднили органічними речовинами (зазвичай, каналізаційними стоками). В такій воді легко розвиваються мікроскопічні водорості, що у теплу погоду може призвести до «цвітіння води»"
    },
    {
        key: "БСК5..МгО.дм3",
        abr: "БСК5 МгО.дм3",
        printName: "Біохімічне споживання кисню (БСК)",
        description: "Це кількість кисню, яка потрібна бактеріям у воді для того, щоб очистити її від органічних забруднювачів. У природних водоймах БСК низьке. Воно зростає, коли воду забруднюють каналізаційні стоки або відходи сільськогосподарських підприємств"
    },
    {
        key: "Завислі..суспендовані..речовини..мг.дм3",
        abr: "Зав.сусп.реч.",
        printName: "Завислі (тверді) речовини",
        description: "Присутні в природних водоймах. Складаються з частинок глини, піску, мулу, органічних і неорганічних речовин, різних мікроорганізмів. Завислі речовини впливають на прозорість води, на температуру, склад розчинних компонентів, адсорбцію токсичних речовин, а також на склад і розподіл відкладень"
    },
    {
        key: "Кисень.розчинений.МгО2.дм3",
        abr: "Кис. розч",
        printName: "Кисень розчинений",
        description: "Його використовує риба для дихання. Якщо його вміст падає нижче критичного показника, риба може вимирати. Рівень кисню знижується у забрудненій воді"
    },
    {
        key: "Нітрат.іони..мг.дм3",
        abr: "Нітрат-іони",
        printName: "Нітрат-іони",
        description: "Добре розчинені у воді солі азотної кислоти. Якщо їх побільшало у воді, ймовірно, її забруднили стічними водами з ферм та добривами. Останні часто змиває дощами з полів. В такій воді легко розвиваються мікроскопічні водорості, що у теплу погоду може призвести до «цвітіння води»"
    },
    {
        key: "Нітрит.іони..мг.дм3",
        abr: "Нітрит-іони",
        printName: "Нітрит-іони",
        description: "Висока їх концентрація свідчить про те, що у воду потрапили органічні речовини зі стічних вод. Швидко розкладаються, тому висока концентрація означає, що забруднення відбулося недавно. В такій воді легко розвиваються мікроскопічні водорості, що у теплу погоду може призвести до «цвітіння води»"
    },
    {
        key: "Сульфат.іони..мг.дм3",
        abr: "Сульфат-іони",
        printName: "Сульфат-іони",
        description: "Зазвичай потрапляють у воду із промисловими стоками (особливо з шахт). Можуть також свідчити про забруднення води органічними речовинами, наприклад, відходами тваринного походження"
    },
    {
        key: "Перманганатна.окислюваність..мгО.дм3",
        abr: "Перм.окисл.",
        printName: "Перманганатна окислюваність",
        description: "Показник, який позначає загальну кількість токсичних речовин у воді. Чим він вищий, тим вода брудніша"
    },
    {
        key: "Фітопланктон..тис.клітин.дм3",
        abr: "Фітопланктон",
        printName: "Фітопланктон",
        description: "Невеликі водорості у воді. Високий показник означає «цвітіння води». Це робить воду непридатною для вживання і може призвести до масового вимирання риб"
    },
    {
        key: "Хлорид.іони..мг.дм3",
        abr: "Хлорид-іони",
        printName: "Хлорид-іони",
        description: "Високий вміст хлоридів свідчить, що воду забруднюють господарсько-побутовими і промисловими стічними водами"
    },
    {
        key: "Фосфат.іони..поліфосфати...мг.дм3",
        abr: "Фосфат-іони",
        printName: "Фосфат-іони",
        description: "У водоймах де підвищується вміст фосфатів збільшується кількість водоростей. Особливо це характерно ділянок водойм де вода застоюється на одному місці, або рухається повільно. Вміст сполук фосфору змінюється сезонно, мінімальна концентрації фосфатів спостерігаються звичайно навесні і влітку, максимальні – восени і взимку. Він частіше за все потрапляє із побутової хімії, через міські каналізації"
    },
    {
        key: "Хімічне.споживання.кисню..мгО.дм3",
        abr: "XСК5 МгО.дм3",
        printName: "Хімічне споживання кисню (ХСК)",
        description: "Кількість кисню, яка потрібна для того, щоб розклались сторонні речовини (органічні й неорганічні) у воді. Таким чином вода самоочищується від забруднювачів. Якщо ХСК різко зросло — отже, до водойми потрапило багато брудної води"
    },
    {
        key: "Синтетичні.поверхнево.активні.речовини..аніонні...мг.дм3",
        abr: "СПАР.аніонні",
        printName: "Синтетичні поверхнево-активні речовини (СПАР)",
        description: "Синтетичні поверхнево-активні речовини (СПАР): неорганічні та органічні речовини, які утворюють піну на поверхні води. Вони потрапляють у воду разом з каналізаційними і промисловими стоками. Призводять до росту мікроскопічних водоростей та зменшують кількість кисню, що розчиняється у воді"
    }

];

var locale = d3.timeFormatLocale({
    "dateTime": "%A, %e %B %Y г. %X",
    "date": "%d.%m.%Y",
    "time": "%H:%M:%S",
    "periods": ["AM", "PM"],
    "days": ["неділя", "понеділок", "вівторок", "середа", "четвер", "пʼятниця", "субота"],
    "shortDays": ["вс", "пн", "вт", "ср", "чт", "пт", "сб"],
    "months": ["cічень", "лютий", "березень", "квітень", "травень", "червень", "липень", "серпень", "вересень", "жовтень", "листопад", "грудень"],
    "shortMonths": ["січ", "лют", "бер", "квт", "трав", "черв", "лип", "серп", "вер", "жовт", "лист", "груд"]
});


var formatMonth = locale.format("%B"),
    formatYear = locale.format("%b-%Y");


function multiFormat(date) {
    return (d3.timeYear(date) < date ? formatMonth
        : formatYear)(date);
}

var parseTime = d3.timeParse("%Y-%m-%d");


/* кількість ticks для вісі Х*/
function numTicks(widther) {
    return widther <= 900 ? 4 : 8;
}


/* end of line chart*/
d3.selection.prototype.moveToFront = function() {
    return this.each(function(){
        this.parentNode.appendChild(this);
    });
};



function r(angle) {
    return "rotate(" + (angle / Math.PI * 180) + ")";
}

function polarToCartesian(angle, radius) {
    return {
        x: Math.cos(angle) * radius,
        y: Math.sin(angle) * radius
    };
}
/* end of flowers */

function petalFill(d) {
    //якщо не кисень
    if (d.data.key != "Кисень.розчинений.МгО2.дм3") {
        return d.data.size > 0.9 ? reds[2] : green;
    }
    //якщо кисень
    if (d.data.key === "Кисень.розчинений.МгО2.дм3") {
        return d.data.size > 0.9 ? green : reds[2];
    }
}



function retrieve(layername, method, param, cb){
    if (datasets[layername]) return cb(datasets[layername]);

    return method(param, function(err, data){
        if (err) throw err;

        var filtered = topojson.feature(data, data.objects[layername])
            .features.filter(function (d) {
                // return d.properties.a_WIDTH5 > 5;
                return d;
            });

        datasets[layername] = filtered;
        return cb(filtered);
    })
}


var points_data;

function retrieve_points_data(cb) {
    if (points_data) return cb(points_data);

    return d3.csv("data/lastDayMeanValueAllKey2.csv", function(err, data){
        if (err) throw err;     
        

        all_flower_data = data;
        if (cb) return cb(data);
        return;
    })
}
